
# 等腰三角形
# x=1
# while x<=5:
#     h=1
#     while h <= 5 - x:
#         print(" ",end="")
#         h=h+1
#
#     k=1
#     while k<= 2*x-1:
#         print("*",end="")
#         k+=1
#     print()
#     x=x+1



# 当输入是54321时，写出下面程序的执行结果
# nunm = int(input("请输入一个数"))
# while nunm !=0:
#     print(nunm % 10)
#     nunm = nunm //10
# 结果显示
# 请输入一个数54321
# 1
# 2
# 3
# 4
# 5



#有一个列表，[“北京”,”上海”,”广东”]
# a =["北京","上海","广东","天津","山东"]
# i=1
# a[i],a[i+1]=a[i+1],a[i]
# print(a)








# 请统计前8城市的GDP总和，平均GDP。
# lst =36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20
# print("总和",sum(lst))
# print("平均数",sum(lst)/8)









# 有以下一个列表，求其中是5的倍数的和
# a = [1, 5, 21, 30, 15, 9, 30, 24]
# i = 0
# num = 0
# while i < len(a):
#     if a[i] % 5 == 0:
#         print(a[i])
#         num = num + a[i]
#     i = i + 1
# print(num)







# 有下列列表，请编程实现列表的数据翻转
# list = [1,2,3,4,5,6,7,8,9]
# list1= list[::-1]
# print(list1)




# 请编程统计列表中的每个数字出现的次数
# list = [1,4,7,5,8,2,1,3,4,5,9,7,6,1,10]
# a=list.count(1)
# print(a)


